Catalogs/ИнформационныеБазы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>ИнформационныеБазы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Кластеры1С</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяИБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерверБД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерверыБД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазаДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НазначенияИБ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПользователиИБ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторБазы</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПользователяИБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольПользователяИБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеВКластере</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияКонфигурации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВерсииКонфигураций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеКонфигурации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХранилищаКонфигураций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВебСервер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВебСерверы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыИнформационнойБазы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Доступ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПользовательГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПользователиИБ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ПользователиИнформационныхБаз.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ПользователиИнформационныхБаз</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ИнформационнаяБаза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеБазы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПользовательИБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПользователиИБ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ИнформационныеБазы/Forms/ФормаПользователей/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//IPАдресКлиента	////ВремяЗавершенияСпящегоСеанса	////ВремяЗасыпанияПассивногоСеанса	//ВремяНачала	//ВремяПоследнейАктивности	////ДлительностьВызововВсего	////ДлительностьВызововЗа5Мин	////ДлительностьВызововСервисаТекущее	////ДлительностьВызововСервисовВсего	////ДлительностьВызововСервисовЗа5Мин	////ДлительностьВызововСУБДВсего	////ДлительностьВызововСУБДЗа5Мин	////ДлительностьВызововСУБДТекущее	////ДлительностьВызововТекущее	//ИдентификаторИнформационнойБазы	//ИдентификаторПроцесса	//ИдентификаторСеанса	//ИдентификаторСоединения	//ИмяКомпьютера	//ИмяПользователя	//ИмяПриложения	//ИмяТекущегоСервиса	////КодЯзыка	////КоличествоВызововВсего	////КоличествоВызововЗа5Мин	//Лицензии	////НомерСеанса	////НомерСеансаБлокирующегоСУБД	////НомерСеансаВыполнившегоУправляемуюБлокировку	////ОбъемДанныхЗаписанныхНаДискВсего	////ОбъемДанныхЗаписанныхНаДискЗа5Мин	////ОбъемДанныхЗаписанныхНаДискТекущее	////ОбъемДанныхПереданныхИПолученныхКлиентом	////ОбъемДанныхПереданныхИПолученныхКлиентомЗа5Мин	////ОбъемДанныхПереданныхИПолученныхСУБДВсего	////ОбъемДанныхПереданныхИПолученныхСУБДЗа5Мин	////ОбъемДанныхСчитанныхСДискаВсего	////ОбъемДанныхСчитанныхСДискаЗа5Минут	////ОбъемДанныхСчитанныхСДискаТекущее	////ПотреблениеПамятиВсего	////ПотреблениеПамятиЗа5Мин	////ПотреблениеПамятиТекущее	////ПроцессорноеВремяВсего	////ПроцессорноеВремяЗа5Мин	////ПроцессорноеВремяТекущее	////РазделениеДанных	//СоединениеСУБД	//СпящийСеанс  
	
	УстановитьТаблицуПользователей();
	
КонецПроцедуры  

&НаСервере
Процедура УстановитьТаблицуПользователей()

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				|	ПользователиИнформационныхБаз.ПользовательИБ.Наименование КАК ИмяПользователя,
				|	ПользователиИнформационныхБаз.ПользовательИБ КАК ПользовательИБ
				|ПОМЕСТИТЬ ВТ_ПользователиИБ
				|ИЗ
				|	РегистрСведений.ПользователиИнформационныхБаз КАК ПользователиИнформационныхБаз
				|ГДЕ
				|	ПользователиИнформационныхБаз.ИнформационнаяБаза = &ИнформационнаяБаза
				|
				|ИНДЕКСИРОВАТЬ ПО
				|	ИмяПользователя
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ТаблицаСеансов.IPАдресКлиента КАК IPАдресКлиента,
				|	ТаблицаСеансов.ВремяНачала КАК ВремяНачала,
				|	ТаблицаСеансов.ВремяПоследнейАктивности КАК ВремяПоследнейАктивности,
				|	ТаблицаСеансов.ИдентификаторИнформационнойБазы КАК ИдентификаторИнформационнойБазы,
				|	ТаблицаСеансов.ИдентификаторПроцесса КАК ИдентификаторПроцесса,
				|	ТаблицаСеансов.ИдентификаторСеанса КАК ИдентификаторСеанса,
				|	ТаблицаСеансов.ИдентификаторСоединения КАК ИдентификаторСоединения,
				|	ТаблицаСеансов.ИмяКомпьютера КАК ИмяКомпьютера,
				|	ТаблицаСеансов.ИмяПользователя КАК ИмяПользователя,
				|	ТаблицаСеансов.ИмяПриложения КАК ИмяПриложения,
				|	ТаблицаСеансов.ИмяТекущегоСервиса КАК ИмяТекущегоСервиса,
				|	ТаблицаСеансов.Лицензии КАК Лицензии,
				|	ТаблицаСеансов.СоединениеСУБД КАК СоединениеСУБД,
				|	ТаблицаСеансов.СпящийСеанс КАК СпящийСеанс
				|ПОМЕСТИТЬ ВТ_СеансыПользователей
				|ИЗ
				|	&ТаблицаСеансов КАК ТаблицаСеансов
				|ГДЕ
				|	ТаблицаСеансов.ИмяПриложения <> ""RAS""
				|
				|ИНДЕКСИРОВАТЬ ПО
				|	ИмяПользователя
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ЕСТЬNULL(ВТ_ПользователиИБ.ИмяПользователя, ВТ_СеансыПользователей.ИмяПользователя) КАК ИмяПользователя,
				|	ВТ_СеансыПользователей.IPАдресКлиента КАК IPАдресКлиента,
				|	ВТ_СеансыПользователей.ВремяНачала КАК ВремяНачала,
				|	ВТ_СеансыПользователей.ВремяПоследнейАктивности КАК ВремяПоследнейАктивности,
				|	ВТ_СеансыПользователей.ИдентификаторИнформационнойБазы КАК ИдентификаторИнформационнойБазы,
				|	ВТ_СеансыПользователей.ИдентификаторПроцесса КАК ИдентификаторПроцесса,
				|	ВТ_СеансыПользователей.ИдентификаторСеанса КАК ИдентификаторСеанса,
				|	ВТ_СеансыПользователей.ИдентификаторСоединения КАК ИдентификаторСоединения,
				|	ВТ_СеансыПользователей.ИмяКомпьютера КАК ИмяКомпьютера,
				|	ВТ_СеансыПользователей.ИмяПриложения КАК ИмяПриложения,
				|	ВТ_СеансыПользователей.ИмяТекущегоСервиса КАК ИмяТекущегоСервиса,
				|	ВТ_СеансыПользователей.Лицензии КАК Лицензии,
				|	ВТ_СеансыПользователей.СоединениеСУБД КАК СоединениеСУБД,
				|	ВТ_СеансыПользователей.СпящийСеанс КАК СпящийСеанс,
				|	ВЫБОР
				|		КОГДА ВТ_СеансыПользователей.ВремяНачала ЕСТЬ NULL
				|			ТОГДА 1
				|		ИНАЧЕ 0
				|	КОНЕЦ КАК ПолеУпорядочивания
				|ИЗ
				|	ВТ_ПользователиИБ КАК ВТ_ПользователиИБ
				|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_СеансыПользователей КАК ВТ_СеансыПользователей
				|		ПО ВТ_ПользователиИБ.ИмяПользователя = ВТ_СеансыПользователей.ИмяПользователя
				|
				|УПОРЯДОЧИТЬ ПО
				|	ПолеУпорядочивания,
				|	ВремяНачала";
	
	ТаблицаСеансов = АдминистрированиеИнформационныхБаз.ПолучитьТаблицуСеансовИнформационнойБазы(Объект.Ссылка);
	
	Запрос.УстановитьПараметр("ТаблицаСеансов", ТаблицаСеансов);
	Запрос.УстановитьПараметр("ИнформационнаяБаза", Объект.Ссылка);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ТаблицаПользователей.Загрузить(Результат.Выгрузить());	

КонецПроцедуры


&НаКлиенте
Процедура ТаблицаСоединенийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ф = ВыбраннаяСтрока; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьСеанс(Команда)
	
	МассивИдентификаторовСеансов = Новый Массив;
	Для Каждого ИдентификаторСтроки Из Элементы.ТаблицаПользователей.ВыделенныеСтроки Цикл
		ВыделеннаяСтрока = ТаблицаПользователей.НайтиПоИдентификатору(ИдентификаторСтроки);
		Если ЗначениеЗаполнено(ВыделеннаяСтрока.ИдентификаторСеанса) Тогда
			МассивИдентификаторовСеансов.Добавить(ВыделеннаяСтрока.ИдентификаторСеанса);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивИдентификаторовСеансов.Количество() > 0 Тогда
		ЗавершитьСеансНаСервере(МассивИдентификаторовСеансов);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗавершитьСеансНаСервере(МассивИдентификаторовСеансов)
	
	АдминистрированиеИнформационныхБаз.ЗавершитьСеансыИнформационнойБазы(Объект.Ссылка, МассивИдентификаторовСеансов);
	УстановитьТаблицуПользователей();
	
КонецПроцедуры


&НаКлиенте
Процедура Обновить(Команда)
	
	УстановитьТаблицуПользователей();
	
КонецПроцедуры


&НаСервере
Процедура ЗавершитьВсеСеансыНаСервере()

	АдминистрированиеИнформационныхБаз.ЗавершитьСеансыИнформационнойБазы(Объект.Ссылка);
	УстановитьТаблицуПользователей();

КонецПроцедуры


&НаКлиенте
Процедура ЗавершитьВсеСеансы(Команда)  
	
	ЗавершитьВсеСеансыНаСервере();
	
КонецПроцедуры


&НаСервере
Процедура ЗавершитьСпящиеСеансыНаСервере()

	АдминистрированиеИнформационныхБаз.ЗавершитьСеансыИнформационнойБазы(Объект.Ссылка, , Истина);
	УстановитьТаблицуПользователей();
	
КонецПроцедуры


&НаКлиенте
Процедура ЗавершитьСпящиеСеансы(Команда)
	ЗавершитьСпящиеСеансыНаСервере();
КонецПроцедуры
